<script>
export default {
  data() {
    return {
      faq: [
        {
          question: 'Q1.請問可否自備鏡框單配鏡片？',
          answer:
            'A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。'
        },
        {
          question: 'Q2.眼鏡都可以20分鐘取件嗎？',
          answer:
            'A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。'
        },
        {
          question: 'Q3.散光鏡片需要額外加價嗎？',
          answer:
            'A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。'
        },
        {
          question: 'Q4.我可以使用舊眼鏡的度數配鏡片嗎？',
          answer:
            'A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。'
        },
        {
          question: 'Q5.請問可以單購買鏡框嗎？',
          answer:
            'A1.我牌鏡框搭配薄型非球面鏡片 1480 元，搭配功能型鏡片則依鏡片種類加價購買。 當日購買JINS盒裝眼鏡，搭配薄型非球面鏡片 980 元（隔日後則為 1480 元），搭配功能型鏡片則依鏡片種類加價購買。 他牌鏡框，搭配薄型非球面鏡片 1980 元，搭配功能型鏡片則依鏡片種類加價購買。'
        }
      ]
    }
  }
}
</script>
<template>
  <main class="container pt-10 pt-md-20 pt-lg-24 pb-16 pb-lg-20 lh-base">
    <h1 class="title-border mb-6 mb-lg-8 ps-4 fs-4 fw-bold display-md-3">常見問題</h1>
    <h2 class="mb-6 fs-4 fw-bold">我想詢問配鏡問題</h2>
    <ul class="gap-y-6 gap-lg-y-8">
      <li v-for="({ question, answer }, i) in faq" :key="i + question">
        <h3 class="mb-2 fs-5 fw-bold">{{ question }}</h3>
        <p>{{ answer }}</p>
      </li>
    </ul>
  </main>
</template>